{
  "morning": [
    {
      "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
      "english": "We have reached the morning and at this very time all sovereignty belongs to Allah, and all praise is for Allah. None has the right to be worshipped except Allah, alone, without any partner.",
      "repetitions": 1,
      "reference": "Sahih Muslim 2723"
    },
    {
      "arabic": "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ",
      "english": "O Allah, by You we enter the morning, and by You we enter the evening, and by You we live, and by You we die, and to You is the final return.",
      "repetitions": 1,
      "reference": "Sunan al-Tirmidhi 3391"
    },
    {
      "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "english": "O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant, and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I committed. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sins except You.",
      "repetitions": 1,
      "reference": "Sahih al-Bukhari 6306"
    },
    {
      "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
      "english": "O Allah, grant me health in my body. O Allah, grant me health in my hearing. O Allah, grant me health in my sight. None has the right to be worshipped except You.",
      "repetitions": 3,
      "reference": "Sunan Abu Dawud 5090"
    },
    {
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ",
      "english": "O Allah, I take refuge in You from disbelief and poverty.",
      "repetitions": 3,
      "reference": "Sunan Abu Dawud 5091"
    },
    {
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
      "english": "O Allah, I ask You for pardon and well-being in this life and the next.",
      "repetitions": 3,
      "reference": "Sunan Abu Dawud 5074"
    },
    {
      "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
      "english": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad (peace be upon him) as my Prophet.",
      "repetitions": 3,
      "reference": "Sunan al-Tirmidhi 3389"
    },
    {
      "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
      "english": "O Ever-Living, O Self-Sustaining, by Your mercy I seek assistance. Rectify for me all my affairs and do not leave me to myself, even for the blink of an eye.",
      "repetitions": 1,
      "reference": "Sunan al-Nasa'i 1305"
    },
    {
      "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "english": "We have awakened upon the natural religion of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad (peace be upon him), and upon the religion of our father Ibrahim, who was a true Muslim and was not of the polytheists.",
      "repetitions": 1,
      "reference": "Musnad Ahmad 17194"
    },
    {
      "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      "english": "Glory is to Allah and praise is to Him.",
      "repetitions": 100,
      "reference": "Sahih al-Bukhari 6405"
    },
    {
      "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "english": "None has the right to be worshipped except Allah, alone, without any partner. To Him belongs all sovereignty and praise, and He is over all things omnipotent.",
      "repetitions": 10,
      "reference": "Sahih al-Bukhari 6404"
    },
    {
      "arabic": "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
      "english": "O Allah, whatever blessing has been received by me or anyone of Your creation in the morning, it is from You alone, You have no partner. So all praise is due to You and all thanks are due to You.",
      "repetitions": 1,
      "reference": "Sunan Abu Dawud 5073"
    }
  ],
  "evening": [
    {
      "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ",
      "english": "We have reached the evening and at this very time all sovereignty belongs to Allah, and all praise is for Allah. None has the right to be worshipped except Allah, alone, without any partner.",
      "repetitions": 1,
      "reference": "Sahih Muslim 2723"
    },
    {
      "arabic": "اللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ الْمَصِيرُ",
      "english": "O Allah, by You we enter the evening, and by You we enter the morning, and by You we live, and by You we die, and to You is the final return.",
      "repetitions": 1,
      "reference": "Sunan al-Tirmidhi 3391"
    },
    {
      "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "english": "O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant, and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I committed. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sins except You.",
      "repetitions": 1,
      "reference": "Sahih al-Bukhari 6306"
    },
    {
      "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
      "english": "O Allah, grant me health in my body. O Allah, grant me health in my hearing. O Allah, grant me health in my sight. None has the right to be worshipped except You.",
      "repetitions": 3,
      "reference": "Sunan Abu Dawud 5090"
    },
    {
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ",
      "english": "O Allah, I take refuge in You from disbelief and poverty.",
      "repetitions": 3,
      "reference": "Sunan Abu Dawud 5091"
    },
    {
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ",
      "english": "O Allah, I ask You for pardon and well-being in this life and the next.",
      "repetitions": 3,
      "reference": "Sunan Abu Dawud 5074"
    },
    {
      "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ نَبِيًّا",
      "english": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad (peace be upon him) as my Prophet.",
      "repetitions": 3,
      "reference": "Sunan al-Tirmidhi 3389"
    },
    {
      "arabic": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
      "english": "O Ever-Living, O Self-Sustaining, by Your mercy I seek assistance. Rectify for me all my affairs and do not leave me to myself, even for the blink of an eye.",
      "repetitions": 1,
      "reference": "Sunan al-Nasa'i 1305"
    },
    {
      "arabic": "أَمْسَيْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
      "english": "We have reached the evening upon the natural religion of Islam, and upon the word of sincerity, and upon the religion of our Prophet Muhammad (peace be upon him), and upon the religion of our father Ibrahim, who was a true Muslim and was not of the polytheists.",
      "repetitions": 1,
      "reference": "Musnad Ahmad 17194"
    },
    {
      "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      "english": "Glory is to Allah and praise is to Him.",
      "repetitions": 100,
      "reference": "Sahih al-Bukhari 6405"
    },
    {
      "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "english": "None has the right to be worshipped except Allah, alone, without any partner. To Him belongs all sovereignty and praise, and He is over all things omnipotent.",
      "repetitions": 10,
      "reference": "Sahih al-Bukhari 6404"
    },
    {
      "arabic": "اللَّهُمَّ مَا أَمْسَى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لَا شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
      "english": "O Allah, whatever blessing has been received by me or anyone of Your creation in the evening, it is from You alone, You have no partner. So all praise is due to You and all thanks are due to You.",
      "repetitions": 1,
      "reference": "Sunan Abu Dawud 5073"
    }
  ]
}
