[
  {
    "text": "The best of people are those who are most beneficial to others.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "None of you truly believes until he loves for his brother what he loves for himself.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The strong is not the one who overcomes the people by his strength, but the strong is the one who controls himself while in anger.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "A Muslim is the one who avoids harming Muslims with his tongue and hands.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The best charity is that given in Ramadan.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "Whoever fasts Ramadan out of faith and in the hope of reward, his previous sins will be forgiven.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "When Ramadan begins, the gates of Paradise are opened.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The most beloved of people to Allah are those who are most beneficial to people.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "Do not be people without minds of your own, saying that if others treat you well you will treat them well, and that if they do wrong you will do wrong. Instead, accustom yourselves to do good if people do good and not to do wrong if they do evil.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The best of you are those who are best to their families, and I am the best of you to my family.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "Allah is more pleased with the repentance of His servant than one of you is pleased with finding his camel that he had lost in the desert.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The best of you are those who learn the Quran and teach it.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "Whoever believes in Allah and the Last Day should speak good or remain silent.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The most perfect believer in faith is the one whose character is finest and who is kindest to his wife.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The best of you are those who have the best character.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "Paradise is under the feet of mothers.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The best of you is he who is best to his family, and I am the best among you to my family.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "Whoever does not show mercy to others will not be shown mercy.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The best of you are those who are best to their wives.",
    "narrator": "Prophet Muhammad (PBUH)"
  },
  {
    "text": "The most beloved deed to Allah is the most regular and constant even if it were little.",
    "narrator": "Prophet Muhammad (PBUH)"
  }
]

